{
  "catalogData": [
    {
      "id": "1",
      "color": "#e66465",
      "date": "20/11/23, 10:00",
      "title": "Салат Цезарь",
      "recipe": "Ингредиенты: куриное филе, салат Айсберг, помидоры, сыр Пармезан, хлеб для гренок, соус Цезарь. \nПриготовление: обжарить куриное филе, нарезать салат и помидоры, смешать все ингредиенты и заправить соусом.",
      "cookingTime": "00:10"
    },
    {
      "id": "2",
      "color": "#f6b73c",
      "date": "21/10/23, 11:00",
      "title": "Паста с креветками",
      "recipe": "Ингредиенты: спагетти, креветки, чеснок, оливковое масло, петрушка. \nПриготовление: сварить спагетти, обжарить креветки с чесноком на оливковом масле, смешать с пастой и посыпать петрушкой.",
      "cookingTime": "00:20"
    },
    {
      "id": "3",
      "color": "#B9DFD1",
      "date": "22/10/23, 12:00",
      "title": "Омлет",
      "recipe": "Ингредиенты: яйца, молоко, соль, перец, овощи (помидоры, перец, лук), сыр. \nПриготовление: взбить яйца с молоком и специями, добавить нарезанные овощи и сыр, жарить на сковороде.",
      "cookingTime": "00:30"
    },
    {
      "id": "4",
      "color": "#F3BCBA",
      "date": "23/10/23, 13:00",
      "title": "Греческий салат",
      "recipe": "Ингредиенты: помидоры, огурцы, перец, красный лук, маслины, сыр Фета, оливковое масло, уксус. \nПриготовление: нарезать овощи, добавить маслины и сыр, заправить оливковым маслом и уксусом.",
      "cookingTime": "00:40"
    },
    {
      "id": "5",
      "color": "#5E3B3B",
      "date": "24/10/23, 14:00",
      "title": "Куриные крылышки BBQ",
      "recipe": "Ингредиенты: куриные крылышки, соус BBQ. \nПриготовление: запечь куриные крылышки в духовке или на гриле, заправить соусом BBQ",
      "cookingTime": "00:50"
    },
    {
      "id": "6",
      "color": "#8A6347",
      "date": "25/10/23, 18:30",
      "title": "Паста Карбонара",
      "recipe": "Ингредиенты: спагетти, яйца, сыр пармезан, гуанчиале (итальянская свинина). \nПриготовление: сварить спагетти, обжарить кусочки гуанчиале, перемешать со спагетти и яично-сырной смесью",
      "cookingTime": "00:55"
    },
    {
      "id": "7",
      "color": "#7B68EE",
      "date": "27/10/23, 20:15",
      "title": "Томатный суп",
      "recipe": "Ингредиенты: помидоры, лук, чеснок, оливковое масло, томатный сок, соль, перец, базилик. nПриготовление: обжарить лук и чеснок, добавить нарезанные помидоры, томатный сок, проварить до готовности, добавить базилик",
      "cookingTime": "01:00"
    },
    {
      "id": "8",
      "color": "#800000",
      "date": "28/10/23, 19:00",
      "title": "Креветки по-тайски",
      "recipe": "Ингредиенты: креветки, кокосовое молоко, лимонная трава, имбирь, чеснок, лимонный сок, соевый соус. \nПриготовление: обжарить нарезанный имбирь и чеснок, добавить креветки, залить кокосовым молоком с травами, тушить до готовности",
      "cookingTime": "01:30"
    },
    {
      "id": "9",
      "color": "#483D8B",
      "date": "30/10/23, 17:45",
      "title": "Гриль сэндвич",
      "recipe": "Ингредиенты: хлеб, индейка, сыр, помидор, огурец, майонез. \nПриготовление: обжарить ломтики индейки, собрать сэндвич с индейкой, сыром, помидорами, огурцами и майонезом, запечь в гриле",
      "cookingTime": "00:45"
    },
    {
      "id": "10",
      "color": "#8B4513",
      "date": "31/10/23, 19:30",
      "title": "Овощное рагу",
      "recipe": "Ингредиенты: кабачок, баклажан, помидоры, лук, морковь, чеснок, оливковое масло, зелень. \nПриготовление: обжарить лук, морковь, чеснок, добавить нарезанные кабачок, баклажаны, помидоры, тушить до готовности",
      "cookingTime": "00:45"
    },
    {
      "id": "11",
      "color": "#4B7A53",
      "date": "27/10/23, 10:30",
      "title": "Лосось с картофельным пюре",
      "recipe": "Ингредиенты: лосось, картофель, сливочное масло, молоко. \nПриготовление: пожарить лосось на сковороде, приготовить картофельное пюре, подать блюдо горячим",
      "cookingTime": "01:00"
    },
    {
      "id": "12",
      "color": "#935252",
      "date": "30/10/23, 12:00",
      "title": "Тайский креветочный суп",
      "recipe": "Ингредиенты: креветки, кокосовое молоко, имбирь, чеснок, лимонная трава. \nПриготовление: приготовить бульон, добавить креветки и овощи, влить кокосовое молоко, довести до кипения",
      "cookingTime": "00:40"
    },
    {
      "id": "13",
      "color": "#735C48",
      "date": "02/11/23, 19:00",
      "title": "Ризотто с грибами",
      "recipe": "Ингредиенты: рис, грибы, лук, сливочное масло, пармезан. \nПриготовление: обжарить лук и грибы, добавить рис, постепенно влить горячий бульон, подкиснуть пармезаном",
      "cookingTime": "00:45"
    },
    {
      "id": "14",
      "color": "#587A5A",
      "date": "08/11/23, 20:00",
      "title": "Карри с курицей и рисом",
      "recipe": "Ингредиенты: куриное филе, карри-паста, кокосовое молоко, рис. \nПриготовление: обжарить курицу с карри-пастой и кокосовым молоком, приготовить рис",
      "cookingTime": "00:55"
    },
    {
      "id": "15",
      "color": "#8C5E56",
      "date": "11/11/23, 17:00",
      "title": "Паста с томатным соусом и беконом",
      "recipe": "Ингредиенты: паста, помидоры, бекон, чеснок, базилик. \nПриготовление: обжарить бекон с чесноком, добавить помидоры, тушить, добавить вареную пасту",
      "cookingTime": "00:40"
    },
    {
      "id": "16",
      "color": "#6A506A",
      "date": "14/11/23, 15:30",
      "title": "Тунец с овощами на гриле",
      "recipe": "Ингредиенты: тунец, цукини, баклажан, перец, лимон, оливковое масло. \nПриготовление: пожарить тунец на гриле, приготовить овощи, заправить лимоном и маслом",
      "cookingTime": "00:45"
    },
    {
      "id": "17",
      "color": "#4C5760",
      "date": "14/11/24, 18:00",
      "title": "Лазанья с грибами и шпинатом",
      "recipe": "Ингредиенты: лазанья, грибы, шпинат, лук, чеснок, сливки, сыр. \nПриготовление: обжарить грибы с луком и чесноком, добавить шпинат и сливки, сложить слои лазаньи с начинкой, посыпать сыром, запечь в духовке",
      "cookingTime": "01:00"
    },
    {
      "id": "18",
      "color": "#B96A77",
      "date": "14/11/25, 12:00",
      "title": "Тайский салат с морепродуктами",
      "recipe": "Ингредиенты: кальмар, креветки, крабовое мясо, свежие овощи, кунжут, соевый соус, лайм, имбирь. \nПриготовление: приготовить морепродукты, порезать овощи, заправить соевым соусом, лимоном, имбирем и посыпать кунжутом",
      "cookingTime": "00:40"
    }
  ]
}